In [9]:
# Homework 1

import pandas as pd

data = {'First Name': ['Alice', 'Bob', 'Charlie', 'David'], 
        'Age': [25, 30, 35, 40], 
        'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago']} 
df = pd.DataFrame(data)
print(df)

  First Name  Age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [ ]:
# Task 1

col_map={
    "First Name": "first_name",
    "Age" : "age"
}

df.rename(columns=col_map,inplace=True)
df

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles
3      David   40        Chicago

In [15]:
# Task 2

first_three=df.head(3)
print(first_three)

  first_name  age           City
0      Alice   25       New York
1        Bob   30  San Francisco
2    Charlie   35    Los Angeles

In [ ]:
# Task 3

df.age.mean()

In [20]:
# Task 4

df.loc[:, ['first_name', 'City']]

  first_name           City
0      Alice       New York
1        Bob  San Francisco
2    Charlie    Los Angeles
3      David        Chicago

In [ ]:
# Task 5
import numpy as np


df["Salary"] = np.random.randint(30000, 100000)
df

In [ ]:
# Task 6

df.describe()

In [ ]:
# Homework 2

# Task 1

import pandas as pd

sales_and_expenses = {'Month': ['Jan', 'Feb', 'Mar', 'Apr'], 
        'Sales': [5000, 6000, 7500, 8000], 
        'Expenses': [3000, 3500, 4000, 4500]} 
df1 = pd.DataFrame(sales_and_expenses)
print(df1)

  Month  Sales  Expenses
0   Jan   5000      3000
1   Feb   6000      3500
2   Mar   7500      4000
3   Apr   8000      4500

In [ ]:
# Task 2

df1.Sales.max()
df1.Expenses.max()

In [ ]:
# Task 3

df1.Sales.min()
df1.Expenses.min()

In [ ]:
# Task 4

df1.Sales.mean()
df1.Expenses.mean()

In [48]:
# Homework 3

# Task 1

import pandas as pd

expenses = {'Catwgory': ['Rent', 'Utilities', 'Groceries', 'Entertainment'], 
        'January': [1200, 200, 300, 150], 
        'February': [1300, 220, 320, 160],
        'March': [1400, 240, 330, 170],
        'April': [1500, 250, 350, 180]} 
df2 = pd.DataFrame(expenses)
df2.set_index('Catwgory',inplace=True)
df2

               January  February  March  April
Catwgory
Rent              1200      1300   1400   1500
Utilities          200       220    240    250
Groceries          300       320    330    350
Entertainment      150       160    170    180

In [49]:
# Task 2

df2.max(axis=1)

Catwgory
Rent             1500
Utilities         250
Groceries         350
Entertainment     180
dtype: int64

In [ ]:
# Task 3

df2.min(axis=1)

Catwgory
Rent             1200
Utilities         200
Groceries         300
Entertainment     150
dtype: int64

In [51]:
# Task 4
 
df2.mean(axis=1)

Catwgory
Rent             1350.0
Utilities         227.5
Groceries         325.0
Entertainment     165.0
dtype: float64